Revit 2024 API
XYZ.ToString Method
 Gets formatted string showing (X, Y, Z) with values formatted to 9 decimal places.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public override string ToString()
Visual Basic
Public Overrides Function ToString As String
Visual C++
public:
virtual String^ ToString() override
See Also
XYZ Class
Autodesk.Revit.DB Namespace